lpodkalicki/blog/avr/asm/include/ATxmega128A1def.inc
.equ PORTH_DIR = 1760		// I/O Port Data Direction
.equ PORTH_DIRSET = 1761		// I/O Port Data Direction Set
.equ PORTH_DIRCLR = 1762		// I/O Port Data Direction Clear
.equ PORTH_DIRTGL = 1763		// I/O Port Data Direction Toggle
.equ PORTH_OUT = 1764		// I/O Port Output
.equ PORTH_OUTSET = 1765		// I/O Port Output Set
.equ PORTH_OUTCLR = 1766		// I/O Port Output Clear
.equ PORTH_OUTTGL = 1767		// I/O Port Output Toggle
.equ PORTH_IN = 1768		// I/O port Input
.equ PORTH_INTCTRL = 1769		// Interrupt Control Register
.equ PORTH_INT0MASK = 1770		// Port Interrupt 0 Mask
.equ PORTH_INT1MASK = 1771		// Port Interrupt 1 Mask
.equ PORTH_INTFLAGS = 1772		// Interrupt Flag Register
.equ PORTH_PIN0CTRL = 1776		// Pin 0 Control Register
.equ PORTH_PIN1CTRL = 1777		// Pin 1 Control Register
.equ PORTH_PIN2CTRL = 1778		// Pin 2 Control Register
.equ PORTH_PIN3CTRL = 1779		// Pin 3 Control Register
.equ PORTH_PIN4CTRL = 1780		// Pin 4 Control Register
.equ PORTH_PIN5CTRL = 1781		// Pin 5 Control Register
.equ PORTH_PIN6CTRL = 1782		// Pin 6 Control Register
.equ PORTH_PIN7CTRL = 1783		// Pin 7 Control Register

;***************************************************************************
;** PORTJ - Port J
;***************************************************************************
	
.equ PORTJ_DIR = 1792		// I/O Port Data Direction
.equ PORTJ_DIRSET = 1793		// I/O Port Data Direction Set
.equ PORTJ_DIRCLR = 1794		// I/O Port Data Direction Clear
.equ PORTJ_DIRTGL = 1795		// I/O Port Data Direction Toggle
.equ PORTJ_OUT = 1796		// I/O Port Output
.equ PORTJ_OUTSET = 1797		// I/O Port Output Set
.equ PORTJ_OUTCLR = 1798		// I/O Port Output Clear
.equ PORTJ_OUTTGL = 1799		// I/O Port Output Toggle
.equ PORTJ_IN = 1800		// I/O port Input
.equ PORTJ_INTCTRL = 1801		// Interrupt Control Register
.equ PORTJ_INT0MASK = 1802		// Port Interrupt 0 Mask
.equ PORTJ_INT1MASK = 1803		// Port Interrupt 1 Mask
.equ PORTJ_INTFLAGS = 1804		// Interrupt Flag Register
.equ PORTJ_PIN0CTRL = 1808		// Pin 0 Control Register
.equ PORTJ_PIN1CTRL = 1809		// Pin 1 Control Register
.equ PORTJ_PIN2CTRL = 1810		// Pin 2 Control Register
.equ PORTJ_PIN3CTRL = 1811		// Pin 3 Control Register
.equ PORTJ_PIN4CTRL = 1812		// Pin 4 Control Register
.equ PORTJ_PIN5CTRL = 1813		// Pin 5 Control Register
.equ PORTJ_PIN6CTRL = 1814		// Pin 6 Control Register
.equ PORTJ_PIN7CTRL = 1815		// Pin 7 Control Register

;***************************************************************************
;** PORTK - Port K
;***************************************************************************
	
.equ PORTK_DIR = 1824		// I/O Port Data Direction
.equ PORTK_DIRSET = 1825		// I/O Port Data Direction Set
.equ PORTK_DIRCLR = 1826		// I/O Port Data Direction Clear
.equ PORTK_DIRTGL = 1827		// I/O Port Data Direction Toggle
.equ PORTK_OUT = 1828		// I/O Port Output
.equ PORTK_OUTSET = 1829		// I/O Port Output Set
.equ PORTK_OUTCLR = 1830		// I/O Port Output Clear
.equ PORTK_OUTTGL = 1831		// I/O Port Output Toggle
.equ PORTK_IN = 1832		// I/O port Input
.equ PORTK_INTCTRL = 1833		// Interrupt Control Register
.equ PORTK_INT0MASK = 1834		// Port Interrupt 0 Mask
.equ PORTK_INT1MASK = 1835		// Port Interrupt 1 Mask
.equ PORTK_INTFLAGS = 1836		// Interrupt Flag Register
.equ PORTK_PIN0CTRL = 1840		// Pin 0 Control Register
.equ PORTK_PIN1CTRL = 1841		// Pin 1 Control Register
.equ PORTK_PIN2CTRL = 1842		// Pin 2 Control Register
.equ PORTK_PIN3CTRL = 1843		// Pin 3 Control Register
.equ PORTK_PIN4CTRL = 1844		// Pin 4 Control Register
.equ PORTK_PIN5CTRL = 1845		// Pin 5 Control Register
.equ PORTK_PIN6CTRL = 1846		// Pin 6 Control Register
.equ PORTK_PIN7CTRL = 1847		// Pin 7 Control Register

;***************************************************************************
;** PORTQ - Port Q
;***************************************************************************
	
.equ PORTQ_DIR = 1984		// I/O Port Data Direction
.equ PORTQ_DIRSET = 1985		// I/O Port Data Direction Set
.equ PORTQ_DIRCLR = 1986		// I/O Port Data Direction Clear
.equ PORTQ_DIRTGL = 1987		// I/O Port Data Direction Toggle
.equ PORTQ_OUT = 1988		// I/O Port Output
.equ PORTQ_OUTSET = 1989		// I/O Port Output Set
.equ PORTQ_OUTCLR = 1990		// I/O Port Output Clear
.equ PORTQ_OUTTGL = 1991		// I/O Port Output Toggle
.equ PORTQ_IN = 1992		// I/O port Input
.equ PORTQ_INTCTRL = 1993		// Interrupt Control Register
.equ PORTQ_INT0MASK = 1994		// Port Interrupt 0 Mask
.equ PORTQ_INT1MASK = 1995		// Port Interrupt 1 Mask
.equ PORTQ_INTFLAGS = 1996		// Interrupt Flag Register
.equ PORTQ_PIN0CTRL = 2000		// Pin 0 Control Register
.equ PORTQ_PIN1CTRL = 2001		// Pin 1 Control Register
.equ PORTQ_PIN2CTRL = 2002		// Pin 2 Control Register
.equ PORTQ_PIN3CTRL = 2003		// Pin 3 Control Register
.equ PORTQ_PIN4CTRL = 2004		// Pin 4 Control Register
.equ PORTQ_PIN5CTRL = 2005		// Pin 5 Control Register
.equ PORTQ_PIN6CTRL = 2006		// Pin 6 Control Register
.equ PORTQ_PIN7CTRL = 2007		// Pin 7 Control Register

;***************************************************************************
;** PORTR - Port R
;***************************************************************************
	
.equ PORTR_DIR = 2016		// I/O Port Data Direction
.equ PORTR_DIRSET = 2017		// I/O Port Data Direction Set
.equ PORTR_DIRCLR = 2018		// I/O Port Data Direction Clear
.equ PORTR_DIRTGL = 2019		// I/O Port Data Direction Toggle
.equ PORTR_OUT = 2020		// I/O Port Output
.equ PORTR_OUTSET = 2021		// I/O Port Output Set
.equ PORTR_OUTCLR = 2022		// I/O Port Output Clear
.equ PORTR_OUTTGL = 2023		// I/O Port Output Toggle
.equ PORTR_IN = 2024		// I/O port Input
.equ PORTR_INTCTRL = 2025		// Interrupt Control Register
.equ PORTR_INT0MASK = 2026		// Port Interrupt 0 Mask
.equ PORTR_INT1MASK = 2027		// Port Interrupt 1 Mask
.equ PORTR_INTFLAGS = 2028		// Interrupt Flag Register
.equ PORTR_PIN0CTRL = 2032		// Pin 0 Control Register
.equ PORTR_PIN1CTRL = 2033		// Pin 1 Control Register
.equ PORTR_PIN2CTRL = 2034		// Pin 2 Control Register
.equ PORTR_PIN3CTRL = 2035		// Pin 3 Control Register
.equ PORTR_PIN4CTRL = 2036		// Pin 4 Control Register
.equ PORTR_PIN5CTRL = 2037		// Pin 5 Control Register
.equ PORTR_PIN6CTRL = 2038		// Pin 6 Control Register
.equ PORTR_PIN7CTRL = 2039		// Pin 7 Control Register

;***************************************************************************
;** TCC0 - Timer/Counter C0
;***************************************************************************
	
.equ TCC0_CTRLA = 2048		// Control Register A
.equ TCC0_CTRLB = 2049		// Control Register B
.equ TCC0_CTRLC = 2050		// Control register C
.equ TCC0_CTRLD = 2051		// Control Register D
.equ TCC0_CTRLE = 2052		// Control Register E
.equ TCC0_INTCTRLA = 2054		// Interrupt Control Register A
.equ TCC0_INTCTRLB = 2055		// Interrupt Control Register B
.equ TCC0_CTRLFCLR = 2056		// Control Register F Clear
.equ TCC0_CTRLFSET = 2057		// Control Register F Set
.equ TCC0_CTRLGCLR = 2058		// Control Register G Clear
.equ TCC0_CTRLGSET = 2059		// Control Register G Set
.equ TCC0_INTFLAGS = 2060		// Interrupt Flag Register
.equ TCC0_TEMP = 2063		// Temporary Register For 16-bit Access
.equ TCC0_CNT = 2080		// Count
.equ TCC0_PER = 2086		// Period
.equ TCC0_CCA = 2088		// Compare or Capture A
.equ TCC0_CCB = 2090		// Compare or Capture B
.equ TCC0_CCC = 2092		// Compare or Capture C
.equ TCC0_CCD = 2094		// Compare or Capture D
.equ TCC0_PERBUF = 2102		// Period Buffer
.equ TCC0_CCABUF = 2104		// Compare Or Capture A Buffer
.equ TCC0_CCBBUF = 2106		// Compare Or Capture B Buffer
.equ TCC0_CCCBUF = 2108		// Compare Or Capture C Buffer
.equ TCC0_CCDBUF = 2110		// Compare Or Capture D Buffer

;***************************************************************************
;** TCC1 - Timer/Counter C1
;***************************************************************************
	
