lpodkalicki/blog/avr/asm/include/ATxmega128A1def.inc
; Windows interrupt mode
.equ AC_WINTMODE_ABOVE_gc = (0x00<<2) ; Interrupt on above window
.equ AC_WINTMODE_INSIDE_gc = (0x01<<2) ; Interrupt on inside window
.equ AC_WINTMODE_BELOW_gc = (0x02<<2) ; Interrupt on below window
.equ AC_WINTMODE_OUTSIDE_gc = (0x03<<2) ; Interrupt on outside window

; Window interrupt level
.equ AC_WINTLVL_OFF_gc = (0x00<<0) ; Interrupt disabled
.equ AC_WINTLVL_LO_gc = (0x01<<0) ; Low priority
.equ AC_WINTLVL_MED_gc = (0x02<<0) ; Medium priority
.equ AC_WINTLVL_HI_gc = (0x03<<0) ; High priority

; Window mode state
.equ AC_WSTATE_ABOVE_gc = (0x00<<6) ; Signal above window
.equ AC_WSTATE_INSIDE_gc = (0x01<<6) ; Signal inside window
.equ AC_WSTATE_BELOW_gc = (0x02<<6) ; Signal below window


;***************************************************************************
;** ADC - Analog/Digital Converter
;***************************************************************************/

; ADC_CH_CTRL masks
.equ ADC_CH_START_bm = 0x80 ; Channel Start Conversion bit mask
.equ ADC_CH_START_bp = 7 ; Channel Start Conversion bit position
.equ ADC_CH_GAINFAC_gm = 0x1C ; Gain Factor group mask
.equ ADC_CH_GAINFAC_gp = 2 ; Gain Factor group position
.equ ADC_CH_GAINFAC0_bm = (1<<2) ; Gain Factor bit 0 mask
.equ ADC_CH_GAINFAC0_bp = 2 ; Gain Factor bit 0 position
.equ ADC_CH_GAINFAC1_bm = (1<<3) ; Gain Factor bit 1 mask
.equ ADC_CH_GAINFAC1_bp = 3 ; Gain Factor bit 1 position
.equ ADC_CH_GAINFAC2_bm = (1<<4) ; Gain Factor bit 2 mask
.equ ADC_CH_GAINFAC2_bp = 4 ; Gain Factor bit 2 position
.equ ADC_CH_INPUTMODE_gm = 0x03 ; Input Mode Select group mask
.equ ADC_CH_INPUTMODE_gp = 0 ; Input Mode Select group position
.equ ADC_CH_INPUTMODE0_bm = (1<<0) ; Input Mode Select bit 0 mask
.equ ADC_CH_INPUTMODE0_bp = 0 ; Input Mode Select bit 0 position
.equ ADC_CH_INPUTMODE1_bm = (1<<1) ; Input Mode Select bit 1 mask
.equ ADC_CH_INPUTMODE1_bp = 1 ; Input Mode Select bit 1 position

; ADC_CH_MUXCTRL masks
.equ ADC_CH_MUXPOS_gm = 0x78 ; Positive Input Select group mask
.equ ADC_CH_MUXPOS_gp = 3 ; Positive Input Select group position
.equ ADC_CH_MUXPOS0_bm = (1<<3) ; Positive Input Select bit 0 mask
.equ ADC_CH_MUXPOS0_bp = 3 ; Positive Input Select bit 0 position
.equ ADC_CH_MUXPOS1_bm = (1<<4) ; Positive Input Select bit 1 mask
.equ ADC_CH_MUXPOS1_bp = 4 ; Positive Input Select bit 1 position
.equ ADC_CH_MUXPOS2_bm = (1<<5) ; Positive Input Select bit 2 mask
.equ ADC_CH_MUXPOS2_bp = 5 ; Positive Input Select bit 2 position
.equ ADC_CH_MUXPOS3_bm = (1<<6) ; Positive Input Select bit 3 mask
.equ ADC_CH_MUXPOS3_bp = 6 ; Positive Input Select bit 3 position
.equ ADC_CH_MUXINT_gm = 0x78 ; Internal Input Select group mask
.equ ADC_CH_MUXINT_gp = 3 ; Internal Input Select group position
.equ ADC_CH_MUXINT0_bm = (1<<3) ; Internal Input Select bit 0 mask
.equ ADC_CH_MUXINT0_bp = 3 ; Internal Input Select bit 0 position
.equ ADC_CH_MUXINT1_bm = (1<<4) ; Internal Input Select bit 1 mask
.equ ADC_CH_MUXINT1_bp = 4 ; Internal Input Select bit 1 position
.equ ADC_CH_MUXINT2_bm = (1<<5) ; Internal Input Select bit 2 mask
.equ ADC_CH_MUXINT2_bp = 5 ; Internal Input Select bit 2 position
.equ ADC_CH_MUXINT3_bm = (1<<6) ; Internal Input Select bit 3 mask
.equ ADC_CH_MUXINT3_bp = 6 ; Internal Input Select bit 3 position
.equ ADC_CH_MUXNEG_gm = 0x03 ; Negative Input Select group mask
.equ ADC_CH_MUXNEG_gp = 0 ; Negative Input Select group position
.equ ADC_CH_MUXNEG0_bm = (1<<0) ; Negative Input Select bit 0 mask
.equ ADC_CH_MUXNEG0_bp = 0 ; Negative Input Select bit 0 position
.equ ADC_CH_MUXNEG1_bm = (1<<1) ; Negative Input Select bit 1 mask
.equ ADC_CH_MUXNEG1_bp = 1 ; Negative Input Select bit 1 position

; ADC_CH_INTCTRL masks
.equ ADC_CH_INTMODE_gm = 0x0C ; Interrupt Mode group mask
.equ ADC_CH_INTMODE_gp = 2 ; Interrupt Mode group position
.equ ADC_CH_INTMODE0_bm = (1<<2) ; Interrupt Mode bit 0 mask
.equ ADC_CH_INTMODE0_bp = 2 ; Interrupt Mode bit 0 position
.equ ADC_CH_INTMODE1_bm = (1<<3) ; Interrupt Mode bit 1 mask
.equ ADC_CH_INTMODE1_bp = 3 ; Interrupt Mode bit 1 position
.equ ADC_CH_INTLVL_gm = 0x03 ; Interrupt Level group mask
.equ ADC_CH_INTLVL_gp = 0 ; Interrupt Level group position
.equ ADC_CH_INTLVL0_bm = (1<<0) ; Interrupt Level bit 0 mask
.equ ADC_CH_INTLVL0_bp = 0 ; Interrupt Level bit 0 position
.equ ADC_CH_INTLVL1_bm = (1<<1) ; Interrupt Level bit 1 mask
.equ ADC_CH_INTLVL1_bp = 1 ; Interrupt Level bit 1 position

; ADC_CH_INTFLAGS masks
.equ ADC_CH_CHIF_bm = 0x01 ; Channel Interrupt Flag bit mask
.equ ADC_CH_CHIF_bp = 0 ; Channel Interrupt Flag bit position

; ADC_CTRLA masks
.equ ADC_DMASEL_gm = 0xC0 ; DMA Selection group mask
.equ ADC_DMASEL_gp = 6 ; DMA Selection group position
.equ ADC_DMASEL0_bm = (1<<6) ; DMA Selection bit 0 mask
.equ ADC_DMASEL0_bp = 6 ; DMA Selection bit 0 position
.equ ADC_DMASEL1_bm = (1<<7) ; DMA Selection bit 1 mask
.equ ADC_DMASEL1_bp = 7 ; DMA Selection bit 1 position
.equ ADC_CH3START_bm = 0x20 ; Channel 3 Start Conversion bit mask
.equ ADC_CH3START_bp = 5 ; Channel 3 Start Conversion bit position
.equ ADC_CH2START_bm = 0x10 ; Channel 2 Start Conversion bit mask
.equ ADC_CH2START_bp = 4 ; Channel 2 Start Conversion bit position
.equ ADC_CH1START_bm = 0x08 ; Channel 1 Start Conversion bit mask
.equ ADC_CH1START_bp = 3 ; Channel 1 Start Conversion bit position
.equ ADC_CH0START_bm = 0x04 ; Channel 0 Start Conversion bit mask
.equ ADC_CH0START_bp = 2 ; Channel 0 Start Conversion bit position
.equ ADC_FLUSH_bm = 0x02 ; Flush Pipeline bit mask
.equ ADC_FLUSH_bp = 1 ; Flush Pipeline bit position
.equ ADC_ENABLE_bm = 0x01 ; Enable ADC bit mask
.equ ADC_ENABLE_bp = 0 ; Enable ADC bit position

; ADC_CTRLB masks
.equ ADC_CONMODE_bm = 0x10 ; Conversion Mode bit mask
.equ ADC_CONMODE_bp = 4 ; Conversion Mode bit position
.equ ADC_FREERUN_bm = 0x08 ; Free Running Mode Enable bit mask
.equ ADC_FREERUN_bp = 3 ; Free Running Mode Enable bit position
.equ ADC_RESOLUTION_gm = 0x06 ; Result Resolution group mask
.equ ADC_RESOLUTION_gp = 1 ; Result Resolution group position
.equ ADC_RESOLUTION0_bm = (1<<1) ; Result Resolution bit 0 mask
.equ ADC_RESOLUTION0_bp = 1 ; Result Resolution bit 0 position
.equ ADC_RESOLUTION1_bm = (1<<2) ; Result Resolution bit 1 mask
.equ ADC_RESOLUTION1_bp = 2 ; Result Resolution bit 1 position

; ADC_REFCTRL masks
.equ ADC_REFSEL_gm = 0x30 ; Reference Selection group mask
.equ ADC_REFSEL_gp = 4 ; Reference Selection group position
.equ ADC_REFSEL0_bm = (1<<4) ; Reference Selection bit 0 mask
.equ ADC_REFSEL0_bp = 4 ; Reference Selection bit 0 position
.equ ADC_REFSEL1_bm = (1<<5) ; Reference Selection bit 1 mask
.equ ADC_REFSEL1_bp = 5 ; Reference Selection bit 1 position
.equ ADC_BANDGAP_bm = 0x02 ; Bandgap enable bit mask
.equ ADC_BANDGAP_bp = 1 ; Bandgap enable bit position
.equ ADC_TEMPREF_bm = 0x01 ; Temperature Reference Enable bit mask
.equ ADC_TEMPREF_bp = 0 ; Temperature Reference Enable bit position

; ADC_EVCTRL masks
.equ ADC_SWEEP_gm = 0xC0 ; Channel Sweep Selection group mask
.equ ADC_SWEEP_gp = 6 ; Channel Sweep Selection group position
.equ ADC_SWEEP0_bm = (1<<6) ; Channel Sweep Selection bit 0 mask
.equ ADC_SWEEP0_bp = 6 ; Channel Sweep Selection bit 0 position
.equ ADC_SWEEP1_bm = (1<<7) ; Channel Sweep Selection bit 1 mask
.equ ADC_SWEEP1_bp = 7 ; Channel Sweep Selection bit 1 position
.equ ADC_EVSEL_gm = 0x38 ; Event Input Select group mask
.equ ADC_EVSEL_gp = 3 ; Event Input Select group position
.equ ADC_EVSEL0_bm = (1<<3) ; Event Input Select bit 0 mask
.equ ADC_EVSEL0_bp = 3 ; Event Input Select bit 0 position
.equ ADC_EVSEL1_bm = (1<<4) ; Event Input Select bit 1 mask
.equ ADC_EVSEL1_bp = 4 ; Event Input Select bit 1 position
.equ ADC_EVSEL2_bm = (1<<5) ; Event Input Select bit 2 mask
.equ ADC_EVSEL2_bp = 5 ; Event Input Select bit 2 position
.equ ADC_EVACT_gm = 0x07 ; Event Action Select group mask
.equ ADC_EVACT_gp = 0 ; Event Action Select group position
.equ ADC_EVACT0_bm = (1<<0) ; Event Action Select bit 0 mask
.equ ADC_EVACT0_bp = 0 ; Event Action Select bit 0 position
.equ ADC_EVACT1_bm = (1<<1) ; Event Action Select bit 1 mask
.equ ADC_EVACT1_bp = 1 ; Event Action Select bit 1 position
.equ ADC_EVACT2_bm = (1<<2) ; Event Action Select bit 2 mask
.equ ADC_EVACT2_bp = 2 ; Event Action Select bit 2 position

