lpodkalicki/blog/avr/asm/include/ATxmega128A1def.inc
; PORTB interrupt vectors
.equ PORTB_INT0_vect = 68 ; External Interrupt 0
.equ PORTB_INT1_vect = 70 ; External Interrupt 1

; ACB interrupt vectors
.equ ACB_AC0_vect = 72 ; AC0 Interrupt
.equ ACB_AC1_vect = 74 ; AC1 Interrupt
.equ ACB_ACW_vect = 76 ; ACW Window Mode Interrupt

; ADCB interrupt vectors
.equ ADCB_CH0_vect = 78 ; Interrupt 0
.equ ADCB_CH1_vect = 80 ; Interrupt 1
.equ ADCB_CH2_vect = 82 ; Interrupt 2
.equ ADCB_CH3_vect = 84 ; Interrupt 3

; PORTE interrupt vectors
.equ PORTE_INT0_vect = 86 ; External Interrupt 0
.equ PORTE_INT1_vect = 88 ; External Interrupt 1

; TWIE interrupt vectors
.equ TWIE_TWIS_vect = 90 ; TWI Slave Interrupt
.equ TWIE_TWIM_vect = 92 ; TWI Master Interrupt

; TCE0 interrupt vectors
.equ TCE0_OVF_vect = 94 ; Overflow Interrupt
.equ TCE0_ERR_vect = 96 ; Error Interrupt
.equ TCE0_CCA_vect = 98 ; Compare or Capture A Interrupt
.equ TCE0_CCB_vect = 100 ; Compare or Capture B Interrupt
.equ TCE0_CCC_vect = 102 ; Compare or Capture C Interrupt
.equ TCE0_CCD_vect = 104 ; Compare or Capture D Interrupt

; TCE1 interrupt vectors
.equ TCE1_OVF_vect = 106 ; Overflow Interrupt
.equ TCE1_ERR_vect = 108 ; Error Interrupt
.equ TCE1_CCA_vect = 110 ; Compare or Capture A Interrupt
.equ TCE1_CCB_vect = 112 ; Compare or Capture B Interrupt

; SPIE interrupt vectors
.equ SPIE_INT_vect = 114 ; SPI Interrupt

; USARTE0 interrupt vectors
.equ USARTE0_RXC_vect = 116 ; Reception Complete Interrupt
.equ USARTE0_DRE_vect = 118 ; Data Register Empty Interrupt
.equ USARTE0_TXC_vect = 120 ; Transmission Complete Interrupt

; USARTE1 interrupt vectors
.equ USARTE1_RXC_vect = 122 ; Reception Complete Interrupt
.equ USARTE1_DRE_vect = 124 ; Data Register Empty Interrupt
.equ USARTE1_TXC_vect = 126 ; Transmission Complete Interrupt

; PORTD interrupt vectors
.equ PORTD_INT0_vect = 128 ; External Interrupt 0
.equ PORTD_INT1_vect = 130 ; External Interrupt 1

; PORTA interrupt vectors
.equ PORTA_INT0_vect = 132 ; External Interrupt 0
.equ PORTA_INT1_vect = 134 ; External Interrupt 1

; ACA interrupt vectors
.equ ACA_AC0_vect = 136 ; AC0 Interrupt
.equ ACA_AC1_vect = 138 ; AC1 Interrupt
.equ ACA_ACW_vect = 140 ; ACW Window Mode Interrupt

; ADCA interrupt vectors
.equ ADCA_CH0_vect = 142 ; Interrupt 0
.equ ADCA_CH1_vect = 144 ; Interrupt 1
.equ ADCA_CH2_vect = 146 ; Interrupt 2
.equ ADCA_CH3_vect = 148 ; Interrupt 3

; TWID interrupt vectors
.equ TWID_TWIS_vect = 150 ; TWI Slave Interrupt
.equ TWID_TWIM_vect = 152 ; TWI Master Interrupt

; TCD0 interrupt vectors
.equ TCD0_OVF_vect = 154 ; Overflow Interrupt
.equ TCD0_ERR_vect = 156 ; Error Interrupt
.equ TCD0_CCA_vect = 158 ; Compare or Capture A Interrupt
.equ TCD0_CCB_vect = 160 ; Compare or Capture B Interrupt
.equ TCD0_CCC_vect = 162 ; Compare or Capture C Interrupt
.equ TCD0_CCD_vect = 164 ; Compare or Capture D Interrupt

; TCD1 interrupt vectors
.equ TCD1_OVF_vect = 166 ; Overflow Interrupt
.equ TCD1_ERR_vect = 168 ; Error Interrupt
.equ TCD1_CCA_vect = 170 ; Compare or Capture A Interrupt
.equ TCD1_CCB_vect = 172 ; Compare or Capture B Interrupt

; SPID interrupt vectors
.equ SPID_INT_vect = 174 ; SPI Interrupt

; USARTD0 interrupt vectors
.equ USARTD0_RXC_vect = 176 ; Reception Complete Interrupt
.equ USARTD0_DRE_vect = 178 ; Data Register Empty Interrupt
.equ USARTD0_TXC_vect = 180 ; Transmission Complete Interrupt

; USARTD1 interrupt vectors
.equ USARTD1_RXC_vect = 182 ; Reception Complete Interrupt
.equ USARTD1_DRE_vect = 184 ; Data Register Empty Interrupt
.equ USARTD1_TXC_vect = 186 ; Transmission Complete Interrupt

; PORTQ interrupt vectors
.equ PORTQ_INT0_vect = 188 ; External Interrupt 0
.equ PORTQ_INT1_vect = 190 ; External Interrupt 1

; PORTH interrupt vectors
.equ PORTH_INT0_vect = 192 ; External Interrupt 0
.equ PORTH_INT1_vect = 194 ; External Interrupt 1

; PORTJ interrupt vectors
.equ PORTJ_INT0_vect = 196 ; External Interrupt 0
.equ PORTJ_INT1_vect = 198 ; External Interrupt 1

; PORTK interrupt vectors
.equ PORTK_INT0_vect = 200 ; External Interrupt 0
.equ PORTK_INT1_vect = 202 ; External Interrupt 1

; PORTF interrupt vectors
.equ PORTF_INT0_vect = 208 ; External Interrupt 0
.equ PORTF_INT1_vect = 210 ; External Interrupt 1

; TWIF interrupt vectors
.equ TWIF_TWIS_vect = 212 ; TWI Slave Interrupt
.equ TWIF_TWIM_vect = 214 ; TWI Master Interrupt

; TCF0 interrupt vectors
.equ TCF0_OVF_vect = 216 ; Overflow Interrupt
.equ TCF0_ERR_vect = 218 ; Error Interrupt
.equ TCF0_CCA_vect = 220 ; Compare or Capture A Interrupt
.equ TCF0_CCB_vect = 222 ; Compare or Capture B Interrupt
.equ TCF0_CCC_vect = 224 ; Compare or Capture C Interrupt
.equ TCF0_CCD_vect = 226 ; Compare or Capture D Interrupt

; TCF1 interrupt vectors
.equ TCF1_OVF_vect = 228 ; Overflow Interrupt
.equ TCF1_ERR_vect = 230 ; Error Interrupt
.equ TCF1_CCA_vect = 232 ; Compare or Capture A Interrupt
.equ TCF1_CCB_vect = 234 ; Compare or Capture B Interrupt

; SPIF interrupt vectors
.equ SPIF_INT_vect = 236 ; SPI Interrupt

; USARTF0 interrupt vectors
.equ USARTF0_RXC_vect = 238 ; Reception Complete Interrupt
.equ USARTF0_DRE_vect = 240 ; Data Register Empty Interrupt
.equ USARTF0_TXC_vect = 242 ; Transmission Complete Interrupt

; USARTF1 interrupt vectors
.equ USARTF1_RXC_vect = 244 ; Reception Complete Interrupt
.equ USARTF1_DRE_vect = 246 ; Data Register Empty Interrupt
.equ USARTF1_TXC_vect = 248 ; Transmission Complete Interrupt



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ OSC_vbase = 2
.equ PORTC_vbase = 4
.equ PORTR_vbase = 8
.equ DMA_vbase = 12
.equ RTC_vbase = 20
.equ TWIC_vbase = 24
.equ TCC0_vbase = 28
.equ TCC1_vbase = 40
.equ SPIC_vbase = 48
.equ USARTC0_vbase = 50
.equ USARTC1_vbase = 56
.equ AES_vbase = 62
.equ NVM_vbase = 64
.equ PORTB_vbase = 68
.equ ACB_vbase = 72
.equ ADCB_vbase = 78
.equ PORTE_vbase = 86
.equ TWIE_vbase = 90
.equ TCE0_vbase = 94
.equ TCE1_vbase = 106
.equ SPIE_vbase = 114
.equ USARTE0_vbase = 116
.equ USARTE1_vbase = 122
.equ PORTD_vbase = 128
.equ PORTA_vbase = 132
.equ ACA_vbase = 136
.equ ADCA_vbase = 142
.equ TWID_vbase = 150
.equ TCD0_vbase = 154
.equ TCD1_vbase = 166
.equ SPID_vbase = 174
.equ USARTD0_vbase = 176
.equ USARTD1_vbase = 182
.equ PORTQ_vbase = 188
.equ PORTH_vbase = 192
.equ PORTJ_vbase = 196
.equ PORTK_vbase = 200
.equ PORTF_vbase = 208
.equ TWIF_vbase = 212
.equ TCF0_vbase = 216
.equ TCF1_vbase = 228
.equ SPIF_vbase = 236
.equ USARTF0_vbase = 238
.equ USARTF1_vbase = 244


; ***** INTERRUPT VECTORS, VECTOR OFFSETS *********************************

; OSC interrupt vector offsets

.equ OSC_XOSCF_voffset = 0

; DMA interrupt vector offsets

.equ DMA_CH0_voffset = 0
.equ DMA_CH1_voffset = 2
.equ DMA_CH2_voffset = 4
.equ DMA_CH3_voffset = 6

; NVM interrupt vector offsets

.equ NVM_EE_voffset = 0
.equ NVM_SPM_voffset = 2

; AC interrupt vector offsets

.equ AC_AC0_voffset = 0
.equ AC_AC1_voffset = 2
.equ AC_ACW_voffset = 4

; ADC interrupt vector offsets

.equ ADC_CH0_voffset = 0
.equ ADC_CH1_voffset = 2
.equ ADC_CH2_voffset = 4
.equ ADC_CH3_voffset = 6

; RTC interrupt vector offsets

.equ RTC_OVF_voffset = 0
.equ RTC_COMP_voffset = 2

; TWI interrupt vector offsets

.equ TWI_TWIS_voffset = 0
.equ TWI_TWIM_voffset = 2

; PORT interrupt vector offsets

.equ PORT_INT0_voffset = 0
.equ PORT_INT1_voffset = 2

; TC0 interrupt vector offsets

.equ TC0_OVF_voffset = 0
.equ TC0_ERR_voffset = 2
.equ TC0_CCA_voffset = 4
.equ TC0_CCB_voffset = 6
.equ TC0_CCC_voffset = 8
.equ TC0_CCD_voffset = 10

; TC1 interrupt vector offsets

.equ TC1_OVF_voffset = 0
.equ TC1_ERR_voffset = 2
.equ TC1_CCA_voffset = 4
.equ TC1_CCB_voffset = 6

; USART interrupt vector offsets

.equ USART_RXC_voffset = 0
.equ USART_DRE_voffset = 2
.equ USART_TXC_voffset = 4

; SPI interrupt vector offsets

.equ SPI_INT_voffset = 0

; AES interrupt vector offsets

.equ AES_INT_voffset = 0



.equ INT_VECTORS_SIZE = 250 ; size in words


#endif  /* _ATxmega128A1DEF_INC_ */

; ***** END OF FILE ******************************************************



